# ---------------------------------------------------------------------------------------
# ------------------------------ Создание класса ----------------------------------------
# ---------------------------------------------------------------------------------------

class Dog(): # <---------- Определение класса с именем

    def __init__(self, name, age):
        
        # Инициализируем атрибуты
        self.name = name
        self.age = age

    # Создаём методы
    
    def sit(self):
        print(f'{self.name} is now sitting')

    def roll_over(self):
        print(f'{self.name} rolled over')


# ---------------------------------------------------------------------------------------
# ------------------------------ Создание экземпляра класса -----------------------------
# ---------------------------------------------------------------------------------------

my_dog = Dog('Mark', 6)

print(f'My dogs name is {my_dog.name}. He is {my_dog.age} years old') # <------ Обращение к атрибуту класса 

my_dog.roll_over()

# ! На основе класса можно создать столько экземпляров, сколько потребуется.

